* 目标

** 使用spm+swift工具开发学习基础语法, 兼容termux
:PROPERTIES:
:toggl-project: Work
:END:
:LOGBOOK:
CLOCK: [2022-10-16 周日 10:21]--[2022-10-16 周日 10:51] =>  0:30
CLOCK: [2022-10-16 周日 10:08]--[2022-10-16 周日 10:21] =>  0:13
:END:

*** 添加依赖集成(目的在termux能够正常使用的库)
新建项目spi
命令解析行
开发一个接受入参数的命令工具

*** 在swiftpm下执行quick单元测试
:LOGBOOK:
CLOCK: [2022-10-16 周日 11:44]--[2022-10-16 周日 12:14] =>  0:30
:END:
quick

** 发布到github上，支持action集成功能

** 总结xcodebuild和swift test 之间使用场景
